#include "AudioCatalog.h"
#include "AudioManager.h"

namespace {
	void LoadAudioIfNeeded_(const char* key, const char* fileName) {
		TKM::AudioManager::GetInstance()->LoadSound(key, fileName);
	}
}

//=============================================================
// 共通音声
//=============================================================
void AudioCatalog::LoadCommonAudios() {}

//=============================================================
// タイトル音声
//=============================================================
void AudioCatalog::LoadTitleAudios() {
	//////////////////////////////////////
	LoadCommonAudios(); // 共通音声もロード
	//////////////////////////////////////
}

//=============================================================
// ゲーム本編音声
//=============================================================
void AudioCatalog::LoadGameAudios() {
	//////////////////////////////////////
	LoadCommonAudios(); // 共通音声もロード
	//////////////////////////////////////
}

//=============================================================
// リザルト音声
//=============================================================
void AudioCatalog::LoadResultAudios() {
	//////////////////////////////////////
	LoadCommonAudios(); // 共通音声もロード
	//////////////////////////////////////
}